package com.startest.wm.enums;

/**
 * @公司 北京星天科技
 * @作者 杨世凯
 * @创建时间 2020-09-18-11:18
 * @描述 质控配置项枚举
 */
public enum EnumCheckConfigType {
    /**
     * 海图评价参数
     */
    评优每工天错漏率上限值,
    评合格每工天错漏率下限值,
    评优秀每工天错漏率上限值_s57,
    评合格每工天错漏率下限值_s57,
    评优秀每工天错漏率上限值_图集插图,
    评合格每工天错漏率下限值_图集插图,
    组长优秀率参数,
    编辑_校对_作业员评优秀比例参数,

    /**
     * 航海资料评价参数
     */
    航海产品质量参数_错漏工天k1,
    航海产品质量参数_错漏工天k2,
    水文产品质量参数_错漏工天k1,
    水文产品质量参数_错漏工天k2,
    翻译产品质量参数_错漏工天k1,
    翻译产品质量参数_错漏工天k2,
    编辑差错率_错漏工天m1,
    编辑差错率_错漏工天m2,
    校对审查消灭错漏率n1,
    校对审查消灭错漏率n2,

    /**
     *航海通告评定参数
     */
    产品质量参数k1,
    产品质量参数k2,
    编辑每项差错M1,
    编辑每项差错M2,
    校对审查消灭错漏率m1,
    校对审查消灭错漏率m2,
    书表编辑优秀百分比,
    书表校对优秀百分比,
    书表审查优秀百分比,
    通告编辑优秀百分比,
    通告校对优秀百分比,
    通告审查优秀百分比
}
